CSI API ETABS v1

# cSapModelOptions Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cOptions Options { get; }

    ReadOnly Property Options As cOptions
    	Get

    Dim instance As cSapModel
    Dim value As cOptions

    value = instance.Options

    property cOptions^ Options {
    	cOptions^ get ();
    }

    abstract Options : cOptions with get

#### Property Value

Type: cOptions

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com